# 3.7) Pandas: Pivoting from "Long" to "Wide" Format

**Created by Vitor Kamada**

**Date:** 8/24/2019

In [0]:
import numpy as np
import pandas as pd

Create a DataFrame:

In [2]:
Long = pd.DataFrame({ 'Year':['2010','2010','2010',
                               '2011','2011','2011',
                               '2012','2012','2012'],
                       'Day':['Mon','Tue','Wed',
                                'Mon','Tue','Wed',
                                'Mon','Tue','Wed'],
                       'Value': np.arange(9)})
Long

   Year  Day  Value
0  2010  Mon      0
1  2010  Tue      1
2  2010  Wed      2
3  2011  Mon      3
4  2011  Tue      4
5  2011  Wed      5
6  2012  Mon      6
7  2012  Tue      7
8  2012  Wed      8

Pivot from "long" to wide:

In [3]:
Wide = Long.pivot('Year','Day')
Wide

     Value
Day    Mon Tue Wed
Year
2010     0   1   2
2011     3   4   5
2012     6   7   8

Stack from collum to row:

In [4]:
Col_to_Row = Wide.stack()
Col_to_Row

          Value
Year Day
2010 Mon      0
     Tue      1
     Wed      2
2011 Mon      3
     Tue      4
     Wed      5
2012 Mon      6
     Tue      7
     Wed      8

Unstack from row to collum:

In [5]:
Col_to_Row.unstack()

     Value
Day    Mon Tue Wed
Year
2010     0   1   2
2011     3   4   5
2012     6   7   8